Repository: Worayot/pulse
Catalog: lib/l10n/app_*.arb
Languages: th

# greeting
source: Welcome
th: ยินดีต้อนรับ

source: Back
th: กลับ

# settingsTitle
source: Settings
th: การตั้งค่า

# sentenceemojiText
source: Nothing more to be seennn. We will notify you if changes are made.
th: ไม่มีอะไรเพิ่มเติมแล้ววว เราจะแจ้งให้คุณทราบหากมีการเปลี่ยนแปลง

# sentenceupdateScoreHere
source: You can view or update patient's scoring
th: คุณสามารถดูหรืออัปเดต คะแนนของผู้ป่วย

# homeTitle
source: Home
th: หน้าแรก

source: All Features
th: ฟีเจอร์ทั้งหมด

source: Search Features
th: ค้นหาฟีเจอร์

# futureFeatures
source: Future Updates
th: อัปเดตในอนาคต

source: Languages
th: ภาษา

# descriptionMEWsFeature
source: Notification System
th: ระบบการแจ้งเตือน

# descriptionpatientsFeature
source: Patients' Database
th: ฐานข้อมูลผู้ป่วย

# descriptioncalculatorFeature
source: Calculate MEWs
th: คำนวณ MEWs

# descriptionscoreUpdate
source: * Data will be automatically stored in the database.
th: *ข้อมูลจะถูกจัดเก็บในฐานข้อมูลโดยอัตโนมัติ

# featureNamepatients
source: Patients
th: ผู้ป่วย

# featureNamecalculate
source: Calculate
th: คำนวณ

# notificationFeatureTitle
source: Notifications
th: การแจ้งเตือน

# buttondetails
source: Details
th: รายละเอียด

# buttonaddPatients
source: Add Patient
th: เพิ่มผู้ป่วย

# buttonbackToHome
source: Back to Home
th: กลับสู่หน้าแรก

# buttoncalculate
source: Calculate
th: คำนวณ

# buttonclickHere
source: Click here
th: คลิกที่นี่

# textButtonimport
source: import
th: นำเข้า

# textButtonhere
source: here
th: ที่นี่

# bulletPointpatientDetail
source: Patient's Details
th: รายละเอียดผู้ป่วย

# bulletPointpatientPersonalInfo
source: Patient's Personal Data
th: ข้อมูลส่วนตัวของผู้ป่วย

# bulletPointfullReport
source: Full Report
th: รายงานเต็มรูปแบบ

# textlatestdiagnose
source: Latest Scoring Time
th: เวลาการวินิจฉัยล่าสุด

# texttotalMEWs
source: Total MEWs
th: คะแนน MEWS รวม:

# texthn
source: Hospital number
th: หมายเลขโรงพยาบาล

# textward
source: Ward
th: หอผู้ป่วย

# textname
source: Name
th: ชื่อ

# textsurname
source: Surname
th: นามสกุล

# textgender
source: Gender
th: เพศ

# textage
source: Age
th: อายุ

# textnationality
source: Nationality
th: สัญชาติ

# textdateOfBirth
source: Date of Birth
th: วันเกิด

# textidCardNum
source: ID Card Number
th: หมายเลขบัตรประชาชน

# textaddress
source: Address
th: ที่อยู่

# textpostalcode
source: Postal Code
th: รหัสไปรษณีย์

# textphoneNum
source: Phone Number
th: หมายเลขโทรศัพท์

# textor
source: Or
th: หรือ

# textfromDTB
source: from database
th: จากฐานข้อมูล

# textin
source: In
th: ใน

# texthour
source: hour
th: ชั่วโมง

# textBedNum
source: Bed number
th: หมายเลขเตียง

# textselect
source: Select
th: เลือก

# textinputNum
source: Input scores (Number should fit in the interval.)
th: กรอกคะแนน จำนวนควรอยู่ในช่วงที่กำหนด

# texttotalScore
source: Total Scores
th: คะแนนรวม

# textnursing
source: Nursing
th: การพยาบาล

# resultlow
source: Low risk
th: ความเสี่ยงต่ำ

# resultlowMedium
source: Moderate low risk
th: ความเสี่ยงต่ำถึงปานกลาง

# resultmedium
source: Moderate risk
th: ความเสี่ยงปานกลาง

# resultmediumHigh
source: Moderate high risk
th: ความเสี่ยงสูงปานกลาง

# resulthigh
source: High risk
th: ความเสี่ยงสูง

# nursinglow
source: • Observe and assess symptoms, record vital signs every 8 hours, and monitor according to nursing standards.
th: • สังเกต, ประเมินอาการและบันทึก v/s ทุกๆ 8 ชั่วโมง และเฝ้าระวังตามมาตรฐานของพยาบาล

# nursinglowMedium
source: • Observe and assess symptoms, record vital signs every 4 hours, and monitor according to nursing standards. • Inform to the intern or 1st call physician to assess the condition within 30 minutes and follow treatment orders
th: • สังเกต, ประเมินอาการและบันทึก v/s ทุกๆ 4 ชั่วโมง เฝ้าระวังตามมาตรฐานการพยาบาล รายงานหัวหน้าเวร • รายงานแพทย์ Intern หรือ 1st call มาดูอาการทุกภายใน 30 นาที/สั่งการรักษา

# nursingmedium
source: • Observe and assess symptoms, record vital signs every 2 hours for 3 times (adjust to every 1 hours if the score maintain the same), and monitor according to nursing standards. • Inform to the intern or 1st call physician to assess the condition within 30 minutes and follow treatment orders. • If the condition does not improve, report to the 2nd call and 3rd call physicians to assess the condition within 30 minutes and follow treatment orders.
th: • สังเกตและประเมินอาการทุกๆ 2 ชั่วโมงเป็นจำนวน 3 ครั้ง (เปลี่ยนเป็นทุกๆ 1 ชั่วโมง หากคะแนนยังเท่าเดิม), และเฝ้าระวังตามมาตรฐานการพยาบาล, รายงานหัวหน้าเวร รวมถึงดูแลกิจกรรมการพยาบาลตามอาการ • รายงานแพทย์ Intern หรือ 1st call มาดูอาการภายใน 30 นาที/สั่งการรักษา หากอาการยังไม่ดีขึ้น รายงานไปยังแพทย์ 2nd call และ 3rd call ให้มาดูอาการภายใน 30 นาทีและสั่งการรักษา

# nursingmediumHigh
source: • Observe and assess symptoms, record vital signs every 2 hours for 3 times (adjust to every 1 hours if the score maintain the same), and monitor according to nursing standards. • Inform to the intern or 1st call physician to assess the condition within 30 minutes and follow treatment orders • If the condition does not improve, report to the 2nd call and 3rd call physicians to assess the condition within 30 minutes and follow treatment orders. • Consider increasing the recording of input/output every 4 hours. If urine output is less than 100 cc in 4 hours, report to the physician.
th: • สังเกตและประเมินอาการทุกๆ 30 นาที - 1 ชั่วโมงเป็นจำนวน 3 ครั้ง (เปลี่ยนเป็นทุกๆ 15-30 นาที หากคะแนนยังคงเดิม), เฝ้าระวังตามมาตรฐานการพยาบาลและรายงานหัวหน้าเวร รวมถึงดูแลกิจกรรมการพยาบาลตามอาการ • รายงานไปยังแพทย์ฝึกหัดหรือแพทย์ที่ติดต่อครั้งแรกเพื่อพิจารณาอาการภายใน 30 นาที/ออกคำสั่งการรักษา • หากอาการไม่ดีขึ้น รายงานไปยังแพทย์ 2nd call และ 3rd call เพื่อตรวจสอบอาการภายใน 15 นาทีและออกคำสั่งการรักษา • พิจารณาการบันทึก I/O ทุก 4 ชั่วโมงหากปริมาณปัสสาวะน้อยกว่า 100 ซีซีใน 4 ชั่วโมงให้รายงานไปยังแพทย์

# nursinghigh
source: • Observe symptoms every 15-30 minutes for 3 times (every 15 minutes if score unchanged) and follow nursing standards. • Report to the shift supervisor and manage nursing activities based on symptoms. • Report to the intern or first-call doctor to review symptoms within 30 minutes/issue treatment orders. • If no improvement, report to the second-call & third-call doctors within 15 minutes to review symptoms and issue treatment orders. • Consider adding I/O recording every 2 hours if urine output <50 cc. in 2 hours, and report to the doctor. • If the MEWS score is 5 for 3 consecutive times, consult with the doctor regarding the possibility of transferring the patient to the ICU.
th: • สังเกตและประเมินอาการทุก 15-30 นาที 3 ครั้ง (เปลี่ยนเป็นทุก 15 นาทีหากคะแนนยังคงเดิม) และติดตามตามมาตรฐานการพยาบาล รายงานไปยังผู้ควบคุมเวรและจัดการกิจกรรมการพยาบาลตามอาการ • รายงานไปยังแพทย์ฝึกหัดหรือแพทย์ที่ติดต่อครั้งแรกเพื่อพิจารณาอาการภายใน 30 นาที/ออกคำสั่งการรักษา • หากอาการไม่ดีขึ้น รายงานไปยังแพทย์ที่ติดต่อครั้งที่สองและที่สามเพื่อตรวจสอบอาการภายใน 15 นาทีและออกคำสั่งการรักษา • พิจารณาการบันทึก I/O ทุก 2 ชั่วโมงหากปริมาณปัสสาวะน้อยกว่า 50 ซีซีใน 2 ชั่วโมง และรายงานไปยังแพทย์ • หากคะแนน MEWS เป็น 5 ติดต่อกัน 3 ครั้ง ปรึกษาแพทย์เกี่ยวกับความเป็นไปได้ในการโอนผู้ป่วยไปยังหอผู้ป่วยวิกฤต

# patientId
source: Patient's ID
th: รหัสคนไข้

source: Next
th: ต่อไป

# patientsInSystem
source: Patients' List
th: รายชื่อผู้ป่วยในระบบ

source: Search
th: ค้นหา

# patientNumber
source: Patient No.
th: คนไข้คนที่

source: Added
th: ได้เพิ่ม

source: into your care
th: ในการดูแลของคุณแล้ว

source: No one is here
th: ยังไม่มีใครอยู่ที่นี่เลย

# clickToAddPatient
source: Click to add patient into your care
th: กดเพื่อเพิ่มข้อมูลคนไข้ลงในการดูแล

source: data from database
th: ข้อมูลจากฐานข้อมูล

# floorNumber
source: Floor
th: ชั้นที่

# editPatientData
source: Edit patient's data
th: แก้ไขข้อมูลคนไข้

# noAccount
source: Don't have an account?
th: ยังไม่มีบัญชี?

source: Register now
th: ลงทะเบียนเลย

source: Login
th: เข้าสู่ระบบ

source: Register
th: ลงทะเบียน

# plsEnterTheRightID
source: Please enter the right citizen id
th: กรุณาป้อนเลขบัตรประจำตัวประชาชนให้ถูกต้อง

source: Password
th: รหัสผ่าน

source: Username
th: ชื่อบัญชีผู้ใช้

# plsEnterYourPasword
source: Please enter your pasword
th: กรุณาป้อนรหัสผ่าน

# thaiName
source: Name (Thai)
th: ชื่อเต็ม (ภาษาไทย)

# plsEnterThaiName
source: Please enter your name in Thai
th: กรุณาป้อนชื่อภาษาไทย

# englishName
source: Name (English)
th: ชื่อเต็ม (ภาษาอังกฤษ)

# plsEnterEnglishName
source: Please enter your name in English
th: กรุณาป้อนชื่อภาษาอังกฤษ

source: Email
th: อีเมล

# plsEnterYourEmail
source: Please enter your email
th: กรุณาป้อนอีเมล

source: Personal data
th: ข้อมูลส่วนตัว

# contactInfo
source: Contact Information
th: ช่องทางการติดต่อ

source: Confirm data
th: ยืนยันข้อมูล

source: O'clock
th: นาฬิกา

source: Female
th: หญิง

source: Male
th: ชาย

source: Thai
th: ไทย

source: English
th: อังกฤษ

source: Patient data
th: ข้อมูลคนไข้

source: Full report
th: รายงานฉบับเต็ม

source: Previous
th: ก่อนหน้า

source: Patient database
th: ฐานข้อมูลคนไข้

# observerList
source: List of patients under observation
th: รายชื่อผู้ป่วยที่ทำการเฝ้าระวัง

source: Logout
th: ออกจากระบบ

source: User account
th: บัญชีผู้ใช้

# contactDev
source: Contact developer
th: ติดต่อผู้พัฒนา

source: About app
th: เกี่ยวกับแอป

source: Dark mode
th: โหมดมืด

# addPateintToDatabase
source: Add patient to database
th: เพิ่มผู้ป่วยลงในฐานข้อมูล

source: Swap shift with other nurse
th: เปลี่ยนเวรกับพยาบาลอื่น

source: Swap shift
th: เปลี่ยนเวร

# addPatients
source: Add patient
th: เพิ่มผู้ป่วย

# alert
source: Alert but Confused
th: วุ่นวาย สับสน

source: Conscious
th: รู้สึกตัวดี

# verbalStimuli
source: Responds to Verbal Stimuli
th: ตอบสนองต่อเสียง

# pain
source: Responds to Painful Stimuli
th: ตอบสนองต่อความเจ็บปวด

source: Unresponsive
th: ไม่ตอบสนอง

source: Update patient
th: แก้ไขผู้ป่วย

source: Remove
th: ลบ

source: from your care
th: จากการดูแลของคุณแล้ว

# toDatabase
source: in to database
th: ลงในฐานข้อมูล

source: Add new patient
th: เพิ่มผู้ป่วยใหม่

source: Import patients
th: นำเข้าผู้ป่วย

# clickForQR
source: Click to generate QR Code
th: กดเพื่อสร้าง QR Code

# confirmSwapShift
source: Click to confirm changing shift
th: กดเพื่อยืนยันการผลัดเวร

source: Received patient from
th: ได้รับผู้ป่วยมาจาก

source: OK
th: ตกลง

source: Success
th: สำเร็จ

source: Take shift
th: รับเวร

source: Send shift
th: ส่งเวร

source: Save
th: บันทึก

source: Date
th: วันที่

source: Time
th: เวลา

# addPatientDescription
source: Enter patient's data here
th: กรอกข้อมูลคนไข้ได้ข้างล่าง

# aboutDev
source: About developers
th: เกี่ยวกับผู้พัฒนา

# aboutDevDescription
source: This application was developed by students from Thammasat University Rangsit Campus, Faculty of Engineering, Software Engineering with the following names
th: แอปพลิเคชั่นนี้ถูกพัฒนาโดยนักศึกษาของมหาวิทยาลัยธรรมศาสตร์ ศูนย์รังสิต คณะวิศวกรรมศาสตร์ สาขาวิศวกรรมซอฟต์แวร์ โดยมีรายชื่อดังนี้

# devNames
source: 1. Nutpraphut Prapatsirikul (6510742072) 2. Siwasit Saengnikun (6510742155) 3. Worayot Liamkaew (6510742569) 4. Jirawat Thawonpanthip (6510742031)
th: 1. นายณัฐปภัสร์ ปภัสร์สิริกุล (6510742072) 2. นายศิวศิษย์ แสงนิกุล (6510742155) 3. นายวรยศ เลี่ยมแก้ว (6510742569) 4. นายจิรวัฒน์ ถาวรพันธุ์ทิพย์ (6510742031)

# contactDevAt
source: If you need to contact us, please reach out via email: siwasit.sae@dome.tu.ac.th
th: หากท่านต้องการติดต่อทางเรา ให้ติดต่อผ่านอีเมล: siwasit.sae@dome.tu.ac.th

# plsEnterTheValidEmail
source: Please enter a valid email address
th: กรุณาป้อนอีเมลที่ถูกต้อง

# plsEnterYourNurseIDAsPassword
source: Please enter your nurse ID as password
th: กรุณาป้อนไอดีพยาบาลของคุณ

source: Nurse ID
th: ไอดีพยาบาล

source: About Software
th: เกี่ยวกับซอฟต์แวร์

source: Contact
th: ข้อมูลติดต่อ

source: Tap to edit
th: แตะเพื่อแก้ไข

# editUserDetail
source: Edit user's details
th: แก้ไขรายละเอียดผู้ใช้

# firstDescription
source: Software for nurses and patients
th: ซอฟต์แวร์เพื่อพยาบาลและคนไข้

# secondDescription
source: Application for tracking patient's status.
th: แอปพลิเคชันสำหรับการติดตามสถานะของผู้ป่วย

# thirdDescription
source: MEWS score
th: คะแนน MEWS

# forthDescription
source: Used for evaluation and analysis for patient's overall risk.
th: ใช้ในการวัดสถานะหรือประเมินความเสี่ยงของผู้ป่วย

source: (While giving oxygen)
th: (ขณะให้ออกซิเจน)

source: None
th: ไม่มี

# saveFailed
source: Failed to save the data.
th: การบันทึกข้อมูลล้มเหลว

# fillAllFields
source: Please fill in all the fields
th: โปรดกรอกข้อมูลให้ครบทุกช่อง

# noDataAvail
source: No data available for this patient
th: ไม่มีข้อมูลสำหรับผู้ป่วยรายนี้

source: Document
th: เอกสาร

# exportPatientDocument
source: Export patient's document
th: ส่งออกเอกสารของผู้ป่วย

# plsFillAtLeastOne
source: Please enter information in at least one field.
th: กรุณาป้อนข้อมูลอย่างน้อย 1 ช่อง

source: Export data
th: นำออกข้อมูล

# addManagement
source: Add note
th: เพิ่มหมายเหตุ

# calSuccess
source: Successfully calculated MEWs
th: คำนวนสำเร็จ

# pleaseFillNote
source: Please enter the field.
th: โปรดกรอกหมายเหตุ

# noteSaved
source: Management details saved!
th: บันทึกเสร็จสิ้น

source: Note
th: หมายเหตุ

source: Cancel
th: ยกเลิก

source: Add note details
th: เพิ่มรายละเอียดในช่องหมายเหตุ
